<html>
	<link rel="stylesheet" href="../static/0.css">
	
	<h1>Cr&eacute;er une Entr&eacute;e</h1>
	<p>
		Cette action est accessible au travers l'entr&eacute,e du menu 'Fichier' &rarr; 'Nouvelle Entr&eacute;e'.
		Un Goupe doit &ecirc;tre s&eacute;lectionn&eacute; pour pouvoir r&eacute;aliser cette action.
	</p>
	<p>
		L'Entr&eacute;e cr&eacute;e sera ajout&eacute;e au Groupe s&eacute;lectionn&eacute;. Seulement deux champs doivent &ecirc;tre
		reseign&eacute;s : 'Identifiant' et 'Nom d'utilisateur'. Les autres champs sont optionnels.
	</p>
	<p>
		La date d'expiration est usilis&eacute;e pour les besoins d'affichage de l'Entr&eacute;e mais n'en bloque pas son utilisation
		lorsqu'elle est d&eacute;pass&eacute;e.
		L'URL est utilis&eacute;e pour la navigation rapide et les Notes sont disponibles pour sauvegarder une information 
		associ&eacute;e &agrave; une Entr&eacute;e.
	</p>
	<img src="static/cr&eacute;er_une_entr&eacute;e0.png">
	<p>
		Le mot de passe  peut-&ecirc;tre renseign&eacute; par l'utilisateur mais un g&eacute;n&eacute;rateur de mots de passe est
		disponible en cliquant sur le bouton 'Al&eacute;atoire'. La taille du mot de passe et les cract&egrave;res 
		g&eacute;n&eacute;r&eacute;s peuvent &ecirc;tre configur&eacute;s.
	</p>
	<img src="static/cr&eacute;er_une_entr&eacute;e1.png">
	
	<p>
		Une icone est affich&eacute;e &agrave; la droite de chaque champ, indiquant si les donn&eacute;es renseign&eacute;es sont correctes ou non.
		Une info-bulle est &eacute;galement pr&eacute;sente en cas d'erreur, permettant de conseiller l'utilisateur.
		
		Voici la liste des v&eacute;rifications r&eacute;alis&eacute;es dans cette boite de dialogue :
		<ul>
			<li>L'identifiant ne peut pas &ecirc;tre vide</li>
			<li>La taille de l'identifiant ne peut pas exc&eacute;der 64 caract&egrave;res</li>
			<li>Le nom d'utilisateur ne peut pas &ecirc;tre vide</li>
			<li>La taille du nom d'utilisateur ne peut pas exc&eacute;der 64 caract&egrave;res</li>
			<li>Le couple (identifiant/nom d'utilisateur) existe d&eacute;j&agrave; dans ce Groupe</li>
			<li>La taille du mot de passe ne peut pas exc&eacute;der 200 caract&egrave;res</li>
		</ul>
	</p>
</html>